################4주차###############

###############################
# 연필 = 2000
# 펜 = 3000

# 연필개수 = int(input("연필개수"))
# 펜개수 = int(input("펜개수"))

# 총합 = 연필 * 연필개수 + 펜 * 펜개수

# if 총합 >= 20000:
#     총합 = 총합 * 0.9

# print(총합)
###############################
# 나이 = int(input("나이 입력"))
# if 나이 >= 20:
#     print("성인")
# else:
#     print("미성년자")
###########################
# 주민번호_8번째자리 = int(input("주민번호 8번재 자리 입력"))
# if 주민번호_8번째자리 % 2 == 0:
#     print("여자")
# else:
#     print("남자")
##########################
# 나이 = int(input("나이입력"))

# if 나이 >= 10 :
#     if 나이 >= 20:
#         print("어른")
#     else:
#         print("학생")
# else:
#     print("아이")
######################
# 필기점수 = int(input("필기 점수 입력"))
# 코딩결과 = input("합격/불합격 입력")

# if (필기점수 >= 90) and (코딩결과 == "합격"):
#     print("합격")
# else:
#     print("불합격")

###################5주차#####################

########################
# 점수 = int(input("시험 결과 입력"))

# if 점수 >= 90:
#     print("A")
# elif 점수 >= 80:
#     print("B")
# elif 점수 >= 70:
#     print("C")
# else:
#     print("D")
#########################

#####################6주차####################

########################
