# #1. list
# a = [1, 2, 3, 4, 5]
# b = [6, 7, 8, 9, 10]
# print(a + b) #더하기
# print(a * 3) #곱하기

##################################

# #2. list 인덱스 번호
# a = [1, 2, 3, 4, 5]
# b = [5, 6, 7, 8, 9, 10]
# print(a[0])
# print(a[-1])

##################################

# #3. list 데이터 수정
# a = [1, 2, 3, 4, 5]
# print(a)
# a[0] = 1000
# print(a)

##################################

# #4. list 데이터 추가
# a = [1, 2, 3, 4, 5]
# a.append("한라산") #무조건 마지막에 추가
# print(a)

# a.insert(1, "관악산") #추가시킬 위치를 지정
# print(a)

# a.extend([100,200,300]) #여러개를 한번에 추가
# print(a)

##################################

# #5. list 데이터 삭제
# a = [1, 2, 3, 4, 5]
# del a[0] #인덱스 번호로 삭제
# print(a)

# a.remove(3) #원하는 요소, 값을 삭제
# print(a)

##################################

# #6. list 슬라이싱
# a = [0, 1, 2, 3, 4, 5]
# print(a[0:4])   #0번부터 3번까지 가져온다 ////주의////
# print(a[:])     #전부
# print(a[1:])    #1번부터 마지막까지
# print(a[:3])    #처음부터 2번까지

##################################

# #7. in / not in
# a = [0, 1, 2, 3, 4, 5]
# print(5 in a)
# print(5 not in a)